app/views/movies/_movie.html.erb

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "hj"], ["description", "ghj"], ["movie_length", "ghj"], ["director", "jgh"], ["rating", "ghj"], ["created_at", "2016-04-01 11:28:28.006394"], ["updated_at", "2016-04-01 11:28:28.006394"]]
---
		<div class="panel-body">
			<div style="color: #3BB2D6;"><%= time_ago_in_words(movie.created_at) %></div>