app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_updated_at", "2016-03-28 05:28:15.363219"], ["image_file_name", "hollywood-movie-the-dark-knight-movie-poster_(1).jpg"], ["updated_at", "2016-03-28 05:28:15.662553"], ["id", 18]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)